## Introdution Pandas

### Seris

In [2]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d= {'a': 10, 'b':20 ,'c':30}

In [5]:
nom =  [labels, my_data, arr, d]
for i in nom:
    print(i)

['a', 'b', 'c']
[10, 20, 30]
[10 20 30]
{'a': 10, 'b': 20, 'c': 30}

In [6]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data = my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [12]:
ser1 = pd.Series([1,2,3,4,], ['USA', 'Germany', 'USSR', 'Japan'])

In [15]:
ser2 = pd.Series([1,2,3,4], ['USA', 'Germany', 'Italy' , 'Japan'])

In [13]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [16]:
ser2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [17]:
ser1['USA']

1

In [20]:
ser3 = pd.Series(data= labels)

In [19]:
ser3[1]

'b'

In [21]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

### DataFrames

In [24]:
from numpy.random import randn

In [25]:
np.random.seed(101) # fixation

In [29]:
df = pd.DataFrame(randn(5,4), ['A' ,'B' ,'C' ,'D' ,'E'] , ['W' ,'X' ,'Y' ,'Z']) # create dataframe random 5 rows and 4 columns

In [27]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df['W'] # same like series result

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [31]:
type(df)

pandas.core.frame.DataFrame

In [32]:
df[['W', 'Z']]

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
C  2.154846 -0.346419
D  0.147027  1.024810
E -0.925874  0.610478

In [33]:
df['New_Column'] = df['W'] + df['Z']

In [34]:
df

          W         X         Y         Z  New_Column
A -0.993263  0.196800 -1.136645  0.000366   -0.992897
B  1.025984 -0.156598 -0.031579  0.649826    1.675810
C  2.154846 -0.610259 -0.755325 -0.346419    1.808428
D  0.147027 -0.479448  0.558769  1.024810    1.171837
E -0.925874  1.862864 -1.133817  0.610478   -0.315396

In [36]:
df.drop('New_Column', axis = 1) # important to specific axis

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [37]:
df

          W         X         Y         Z  New_Column
A -0.993263  0.196800 -1.136645  0.000366   -0.992897
B  1.025984 -0.156598 -0.031579  0.649826    1.675810
C  2.154846 -0.610259 -0.755325 -0.346419    1.808428
D  0.147027 -0.479448  0.558769  1.024810    1.171837
E -0.925874  1.862864 -1.133817  0.610478   -0.315396

In [42]:
df_copy = df.copy()
df_copy

          W         X         Y         Z  New_Column
A -0.993263  0.196800 -1.136645  0.000366   -0.992897
B  1.025984 -0.156598 -0.031579  0.649826    1.675810
C  2.154846 -0.610259 -0.755325 -0.346419    1.808428
D  0.147027 -0.479448  0.558769  1.024810    1.171837
E -0.925874  1.862864 -1.133817  0.610478   -0.315396

In [44]:
df_copy.drop('New_Column', axis=1, inplace=True)

In [45]:
df_copy

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [47]:
df.drop('E', axis=0)

          W         X         Y         Z  New_Column
A -0.993263  0.196800 -1.136645  0.000366   -0.992897
B  1.025984 -0.156598 -0.031579  0.649826    1.675810
C  2.154846 -0.610259 -0.755325 -0.346419    1.808428
D  0.147027 -0.479448  0.558769  1.024810    1.171837

In [48]:
df.shape

(5, 5)

- Simple selection

In [51]:
df[['Y']] # select one column

          Y
A -1.136645
B -0.031579
C -0.755325
D  0.558769
E -1.133817

In [50]:
df[['Y', 'New_Column', 'Z']] # many columns name in list

          Y  New_Column         Z
A -1.136645   -0.992897  0.000366
B -0.031579    1.675810  0.649826
C -0.755325    1.808428 -0.346419
D  0.558769    1.171837  1.024810
E -1.133817   -0.315396  0.610478

In [52]:
df.loc['A'] # location use a name of index

W            -0.993263
X             0.196800
Y            -1.136645
Z             0.000366
New_Column   -0.992897
Name: A, dtype: float64

In [54]:
df.iloc[0] # use number of index

W            -0.993263
X             0.196800
Y            -1.136645
Z             0.000366
New_Column   -0.992897
Name: A, dtype: float64

- Condition selection

In [55]:
df >0 # boolean values

       W      X      Y      Z  New_Column
A  False   True  False   True       False
B   True  False  False   True        True
C   True  False  False  False        True
D   True  False   True   True        True
E  False   True  False   True       False

In [56]:
df [df>0]

          W         X         Y         Z  New_Column
A       NaN  0.196800       NaN  0.000366         NaN
B  1.025984       NaN       NaN  0.649826    1.675810
C  2.154846       NaN       NaN       NaN    1.808428
D  0.147027       NaN  0.558769  1.024810    1.171837
E       NaN  1.862864       NaN  0.610478         NaN

In [57]:
df['W']>0

A    False
B     True
C     True
D     True
E    False
Name: W, dtype: bool

In [58]:
df[df['W']>0]

          W         X         Y         Z  New_Column
B  1.025984 -0.156598 -0.031579  0.649826    1.675810
C  2.154846 -0.610259 -0.755325 -0.346419    1.808428
D  0.147027 -0.479448  0.558769  1.024810    1.171837

In [59]:
df[df['Z']<0]

          W         X         Y         Z  New_Column
C  2.154846 -0.610259 -0.755325 -0.346419    1.808428

In [63]:
df[df['W']>0][['X', 'Y']] # use one line to solve

          X         Y
B -0.156598 -0.031579
C -0.610259 -0.755325
D -0.479448  0.558769

In [71]:
boolers = df['W']>0 # same result but many lines to solve. use more memory to execute a programm
results = df[boolers]
cols_select = ['X','Z']
results[cols_select]

          X         Z
B -0.156598  0.649826
C -0.610259 -0.346419
D -0.479448  1.024810

In [77]:
df[(df['Z']>0) & (df['Y']<1)] # & replace 'and', |

          W         X         Y         Z  New_Column
A -0.993263  0.196800 -1.136645  0.000366   -0.992897
B  1.025984 -0.156598 -0.031579  0.649826    1.675810
D  0.147027 -0.479448  0.558769  1.024810    1.171837
E -0.925874  1.862864 -1.133817  0.610478   -0.315396

In [78]:
df.reset_index() # index became a column with column name index. new index will be create start by 0

  index         W         X         Y         Z  New_Column
0     A -0.993263  0.196800 -1.136645  0.000366   -0.992897
1     B  1.025984 -0.156598 -0.031579  0.649826    1.675810
2     C  2.154846 -0.610259 -0.755325 -0.346419    1.808428
3     D  0.147027 -0.479448  0.558769  1.024810    1.171837
4     E -0.925874  1.862864 -1.133817  0.610478   -0.315396

In [80]:
newind = 'CA NY WY OR CO'.split() # create new index with split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [82]:
df['States'] = newind
df

          W         X         Y         Z  New_Column States
A -0.993263  0.196800 -1.136645  0.000366   -0.992897     CA
B  1.025984 -0.156598 -0.031579  0.649826    1.675810     NY
C  2.154846 -0.610259 -0.755325 -0.346419    1.808428     WY
D  0.147027 -0.479448  0.558769  1.024810    1.171837     OR
E -0.925874  1.862864 -1.133817  0.610478   -0.315396     CO

In [84]:
df.set_index('States') # transform column States in index

               W         X         Y         Z  New_Column
States
CA     -0.993263  0.196800 -1.136645  0.000366   -0.992897
NY      1.025984 -0.156598 -0.031579  0.649826    1.675810
WY      2.154846 -0.610259 -0.755325 -0.346419    1.808428
OR      0.147027 -0.479448  0.558769  1.024810    1.171837
CO     -0.925874  1.862864 -1.133817  0.610478   -0.315396

- Index Levels

In [86]:
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [87]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [88]:
inside

[1, 2, 3, 1, 2, 3]

In [89]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [ ]:
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [92]:
hier_index # multiIndex , list of tuple

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [93]:
randn(6,2) # array

array([[-1.3829201 ,  1.4824955 ],
       [ 0.96145816, -2.14121229],
       [ 0.99257345,  1.19224064],
       [-1.04677954,  1.29276458],
       [-1.46751402, -0.49409536],
       [-0.16253473,  0.48580874]])

*Build dataframe : use array plus multiple index name plus column name*

In [90]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B']) # column name A, B

In [91]:
df

             A         B
G1 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125
G2 1 -0.031160  1.939932
   2 -1.005187 -0.741790
   3  0.187125 -0.732845

In [95]:
df.loc['G1']

          A         B
1  0.386030  2.084019
2 -0.376519  0.230336
3  0.681209  1.035125

In [101]:
df.iloc[[0,1,2]]

             A         B
G1 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125

In [104]:
df.index.names # not index names

FrozenList([None, None])

In [107]:
# give index names our data
df.index.names = ['Groups', 'Num']

In [108]:
df

                   A         B
Groups Num
G1     1    0.386030  2.084019
       2   -0.376519  0.230336
       3    0.681209  1.035125
G2     1   -0.031160  1.939932
       2   -1.005187 -0.741790
       3    0.187125 -0.732845

In [109]:
df.loc['G2']

            A         B
Num
1   -0.031160  1.939932
2   -1.005187 -0.741790
3    0.187125 -0.732845

In [110]:
df.xs('G1')

            A         B
Num
1    0.386030  2.084019
2   -0.376519  0.230336
3    0.681209  1.035125

In [111]:
df.xs(1, level= 'Num')

              A         B
Groups
G1      0.38603  2.084019
G2     -0.03116  1.939932

- Missiong Data

In [117]:
d = {'A': [1,2,np.nan], 'B':[5,np.nan, np.nan,], 'C': [1,2,3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [119]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [120]:
df.dropna() # drop line have NaN

     A    B  C
0  1.0  5.0  1

In [121]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [122]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

- Replace NaN

In [123]:

df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [125]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [126]:
df.fillna(value=df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

- groupby method : aggragate function

<a href='https://towardsdatascience.com/all-about-pandas-groupby-explained-with-25-examples-494e04a8ef56'> <img src='groupby_min.png' /></a>

In [130]:
values_company = 'GOOG GOOG MSFT MSFT FB FB'.split()
values_person = 'Sam Charlie Amy Vanessa Carl Sarah'.split()
values_sales = [200,120,340,124,243,350]

In [131]:
data = {'Company': values_company,
        'person': values_person,
        'Sales':[200,120,340,124,243,350]}

In [132]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [134]:
df = pd.DataFrame(data)
df

  Company   person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [150]:
byComp = df.groupby('Company')

In [139]:
byComp.mean('Sales')

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [147]:
df.groupby('Company').sum('Sales')

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [161]:
result = df.groupby('Company')[['Sales']].std()
print(result)

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [162]:
byComp.sum().loc['FB']

person    CarlSarah
Sales           593
Name: FB, dtype: object

In [163]:
df.groupby('Company').max()

          person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [164]:
df.groupby('Company').min()

          person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [166]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [169]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [171]:
df.groupby('Company').describe().reset_index()

  Company Sales
          count   mean         std    min     25%    50%     75%    max
0      FB   2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
1    GOOG   2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
2    MSFT   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [172]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

**Operations**

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [2]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
len(df['col2'].unique())

3

In [5]:
df['col2'].nunique()

3

In [8]:
df['col2'].value_counts() # grouby by column 2 and count element distinct inside
# give each value in col2 and count it eachb

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [9]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [12]:
df[(df['col1']>2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

**apply method**

In [13]:
def times2(x):
    return x*2

In [18]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [19]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [20]:
df['col3'].apply(lambda x:len(x))

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [21]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

**Drop a column**

In [23]:
df.drop('col3', axis = 1)

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [27]:
df.drop('col3', axis = 1)

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [28]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [29]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [30]:
# sort values by column
df.sort_values(by = 'col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [32]:
df.isnull() # boolean values

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [33]:
# Drop rows with NaN Values
df.dropna()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

**NaN values**

In [37]:
import numpy as np

In [38]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [41]:
df.fillna('FILL') # replace NaN values

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

In [42]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [43]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [44]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Data input and Output

- Excel <br>
- CSV <br>
- SQL <br>
- HTML <br>

In [46]:
import pandas as pd

In [57]:
pd.read_csv('example.csv') #  input

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [50]:
pd.read_excel('Excel_Sample.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [51]:
df = pd.read_csv('example.csv')

In [65]:
df.to_csv('My_output.csv', index = False) # Output

In [66]:
pd.read_csv('My_output.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [69]:
pd.read_excel('Excel_Sample.xlsx', sheet_name ='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [70]:
df.to_excel('Excel_exemple2.xlsx', sheet_name= 'NewSheet')

In [71]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [84]:
df

[                               Bank Name               City          State  \
 0  Republic First Bank dba Republic Bank       Philadelphia   Pennsylvania
 1                          Citizens Bank           Sac City           Iowa
 2               Heartland Tri-State Bank            Elkhart         Kansas
 3                    First Republic Bank      San Francisco     California
 4                         Signature Bank           New York       New York
 5                    Silicon Valley Bank        Santa Clara     California
 6                      Almena State Bank             Almena         Kansas
 7             First City Bank of Florida  Fort Walton Beach        Florida
 8                   The First State Bank      Barboursville  West Virginia
 9                     Ericson State Bank            Ericson       Nebraska

     Cert                 Aquiring Institution       Closing Date  \
 0  27332    Fulton Bank, National Association     April 26, 2024
 1   8758            Iowa Trust & Savings Bank   November 3, 2023
 2  25851               Dream First Bank, N.A.      July 28, 2023
 3  59017            JPMorgan Chase Bank, N.A.        May 1, 2023
 4  57053                  Flagstar Bank, N.A.     March 12, 2023
 5  24735  First Citizens Bank & Trust Company     March 10, 2023
 6  15426                          Equity Bank   October 23, 2020
 7  16748            United Fidelity Bank, fsb   October 16, 2020
 8  14361                       MVB Bank, Inc.      April 3, 2020
 9  18265           Farmers and Merchants Bank  February 14, 2020

    Fund  Sort ascending
 0                 10546
 1                 10545
 2                 10544
 3                 10543
 4                 10540
 5                 10539
 6                 10538
 7                 10537
 8                 10536
 9                 10535  ]

In [74]:
type(df)

list

In [77]:
df[0].head()

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540

In [78]:
from sqlalchemy import create_engine

In [79]:
engine = create_engine('sqlite:///:memory:')

In [80]:
engine

Engine(sqlite:///:memory:)

In [86]:
df = df[0]
df.to_sql('data', engine)

10

In [87]:
df

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
5,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
6,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
7,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
8,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
9,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535